from VinormEspeak import PhonemeConverter
from string import punctuation
import fileinput

SETP = []
vifile = "Data/VIDATA.txt"
file = "train.en"
enfile = "Data/ENDATA.txt"


with open("Data/Popular.txt", "r",encoding="utf-8") as f:
    lines = f.read().splitlines()
    for line in lines[:]:
        phonemes = PhonemeConverter(line)
        SETP = list(set(SETP + phonemes))
    print(len(lines))
print(SETP)
print(len(SETP))

#7698
Vi_phone = ['', 'əːɜ', 's', 'yə4', 'əɪ5', 'u2', 'e7', 'ɛ6', 'ə7', 'ɔɜ', 'dʒ', 'p', 'ɗ', 'y6', 'ə2', 'u6', 'a6', 'ɣ', 'yə2', 'əɪ2', 'o2', 'iə4', 'ə5', 'iɛ1', 'aɜ', 'i7', 'ɛ7', 'ɔ4', 'v', 'aːɜ', 'b', ' ', 'l', 'iɛ6', 'əː2', 'yɜ', 'f', 'ɛ4', 'yəɜ', 'e6', 'y5', 'əː6', 'əɜ', 'o6', 'iəɜ', 'əɪ6', 'eɜ', 'e5', 'ə6', 'ɛɜ', 'y2', 'aː2', 'aː5', 'w', 'aː6', 'tʃ', 'x', 'aː4', 'u5', 'ɔ7', 'əː5', 'h', 'uə7', 'uɜ', 'o7', 'i1', 'əɪ7', 'a4', 'uə4', 'y1', 'e1', 'i6', 'yə7', 'iə5', 'ŋ', 'əʊəʊ', 't̪', 'uə6', 'ɔ1', 'j', 'o1', 'aː7', 'u4', 'ɔ5', 'iɛɜ', 'y7', 'yə6', 't', 'əː7', 'y4', 'i4', 'ɲ', 'o5', 'oɜ', 'iɛ5', 'aː1', 'yə5', 'iɛ7', 'əː4', 'u7', 'ə4', 'kh', 'iə6', 'ɔ6', 'uə5', 'm', 'iə7', 'a7', '.', 'a5', 'iɜ', 'e2', 'uə2', 'əːʊ7', 'e4', 'i2', 'iɛ2', 'iː7', 'ɛ5', 'iɛ4', 'i5', 'n', 'k', 'ɛ2', 'ə1', 'yə1', 'c', 'əɪɜ', 'z', 'uəɜ', 'aɪ7', 'əɪ4', 'iə2', 'a2', 'o4', 'ɔ2']
#136


with open(vifile, "r",encoding="utf-8") as f:
    lines = f.read().splitlines()
    for line in lines:
        line = line.split("~")[1]
        phonemes = PhoneConverter(line)
        SETP = list(set(SETP + phonemes))
    print(len(lines))
print(SETP)
print(len(SETP))


for line in fileinput.input(enfile):
    phonemes = PhonemeConverter(line)
    # print(phonemes)
    SETP = list(set(SETP + phonemes))
print(SETP)
print(len(SETP))

Eng_phone = ['', 'ɑː7', ' . t', 'iə1', 'iə7', ' . aː7', ' , i1', 'aː1', ' . , h', 'o6', 'aa', 'e7', 'p', ' . b', 'eɪ1', ' . n', 'ŋ', ' . z', 'k', ' , m', 'ɒ1', ' , ɡ', 'a2', 'ʐ', ' , f', ' . . . t', 'ɹ', ' , ɛɜ', '.', ' , ɛ7', 'ɐɐ', 'a4', 'ɪ7', ' , ʒ', ' . ..', 'ð', 'f', 'i7', ' . v', 'o1', 'b', 'yə2', 'ɛ2', ' , ..', 'ʌ7', 'ɔː1', ' , ɛ1', ' ,.', 'aɪ1', 'i4', 'aː4', 'o2', ' . ð', ' . ɛɜ', 'ɣ', ', ', ' , a1', 'ʊə7', 'a1', ' . i1', ' , k', ' . . ..', ' . i7', 'ɔː7', 'uː7', ' . ɛ7', ' , , ', ' , z', 'iɜ', ' . . ', 'y7', 'ə2', ' , ɣ', 'ə1', 'eə7', ' . . . ..', 'ələl', 'uə1', 'w', 'ɔːɔː', ' . h', 'i1', 'ʊ7', ' , n', ' , a7', 'əː1', ' . f', 'i2', ' , tʃ', ' . ɡ', ' , s', ' . o2', ' , t', 'l', ' . t̪', ' . . . ', 'aʊ1', 'e1', 'eɪ7', 'u7', 't', 'ʊə1', ' , i7', 'iɛ6', ' . ɔ1', 'x', 'ɔ1', 'əʊəʊ', 'dʒ', 'ɔɪ7', 'ʌ1', 'aɪ7', 'əː2', ' , v', ' ..', 'ii', 'aː2', 'ɛ7', ' , h', 'θ', 'a7', ' . ', ' . , ', 'u5', ' ', 'u1', 'ɲ', ' , ɔ1', 'ʃ', 'eə1', 'yə7', 'ɒ7', 'ɔɪ1', 'oɜ', 'ɑː1', 'ʒ', 'ɜː1', ' . , , v', 'yə1', ' , . ', 't̪', 'aɪə1', 'əɪ4', 'ɔɜ', ' , d', ' , p', 'ɡ', 'aɪə7', 'z', 'ʊ1', 'd', ' , ɔ7', ' , u7', ' . , p', ' , ', 'ɛɜ', ' , aː1', ' . aː1', 'm', 'n', ' . s', 'əə', 'ɑːɑː', ' . m', 'j', 'ɛ1', ' , t̪', 'ɪ1', 'iː1', ' , l', 'uː1', 'aː7', 'y1', ' . k', 'tʃ', 'ɔ7', 'c', ' . d', 'aɜ', 'v', 'iɛ2', 'ɗ', 'ɔ6', 'ɔ4', 'iː7', 's', 'aʊ7', 'ɔ2', ' . . . i1', 'əɜ', 'aːɜ', 'h', 'uɜ', 'ɜː7', ' . ɔ7', 'eɜ']
#196
Phone = Vi_phone + Eng_phone
Phone_ = []
for phone in Phone:
    if phone == "" or phone =="." or phone == " " or phone == ",":
        Phone_.append(phone)
        continue
    phone = phone.strip(punctuation+" ")
    Phone_.append(phone)

Phone = list(set(Phone_))
print(Phone)
print(len(Phone))

All = ['', 'eə7', 'ɛ7', 'a7', 'eə1', 'd', 's', 'ə2', 'o5', 'ɛ2', 'a2', 'ɑːɑː', 'iə6', 'u5', 'u2', 'i7', 'c', 'iɛɜ', 'm', 'h', 'iəɜ', 'uɜ', 'a5', 'ð', 'ɔː7', 'uə1', 'ɔɪ7', 'ɹ', 'iə5', 'ʊ1', 'ɐɐ', 'iɛ2', 'ɔɜ', 'ə5', 'ələl', 'y2', 'əːʊ7', 'ə7', 'y5', 'ʊ7', 'ɲ', 'u6', 'əɪ6', 'uə2', 'əɜ', '.', 'u1', 'yə7', 'tʃ', 'aɜ', 'aː2', 'aʊ1', 'ii', 'yə2', 'ə6', 'ɔɪ1', 'əː6', 'u7', 'e1', 'a6', 't̪', 'u4', 'o7', 'ʊə7', 'əə', 'yəɜ', 'e6', 'uə7', 'ɔːɔː', 'ɒ7', 'ɛ1', 'o6', 'əː2', 'iə4', 'aː7', 'e2', 'e7', 'aː4', 'aʊ7', 'əɪ7', 'əɪ4', 't', 'ɑː1', 'l', 'y7', 'kh', 'əː1', ' ', 'y4', 'i5', 'yə1', 'əː5', 'ʌ1', 'uəɜ', 'i6', 'ʌ7', 'aːɜ', 'iː7', 'f', 'i4', 'e5', 'əɪɜ', 'o1', 'iɛ5', 'θ', 'əːɜ', 'j', 'ɔ6', 'ɔ2', 'ɪ1', 'iə7', 'n', 'yə4', 'ŋ', 'iɛ4', 'iː1', 'ʒ', 'i2', 'p', 'o2', 'ɪ7', 'ɔ1', 'ɛ5', 'ɔ7', 'ɑː7', 'ə4', 'eɪ1', 'əɪ2', 'aɪ7', 'dʒ', 'x', 'aː1', 'iə2', 'y6', 'ɔ5', 'uə5', 'ɔː1', 'a4', 'aː6', 'əː7', 'iɜ', 'w', 'əː4', 'əɪ5', 'aɪ1', 'ɔ4', 'aɪə1', 'iɛ7', 'ɛ4', 'i1', 'aɪə7', 'k', 'ɗ', 'uə6', 'ɜː7', 'uə4', 'y1', 'ʃ', 'ɜː1', 'o4', 'v', 'a1', 'e4', 'iə1', 'iɛ6', 'ɒ1', 'yɜ', 'eɪ7', 'yə5', 'ʊə1', 'ɛɜ', 'yə6', 'əʊəʊ', 'ə1', 'eɜ', 'uː7', 'uː1', 'b', 'iɛ1', 'oɜ', 'ɛ6', 'ʐ', 'aː5', 'z', 'ɣ', 'ɡ', 'aa']
#187